Revit 2026 API

# SpaceWallReflectance Property

---

Get or set the Wall Reflectance of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double WallReflectance { get; set; }
```
```vb
Public Property WallReflectance As Double
	Get
	Set
```
```cpp
public:
property double WallReflectance {
	double get ();
	void set (double value);
}
```
```fsharp
member WallReflectance : float with get, set
```

#### Property Value

Double

This property is used to get or set the Wall Reflectance of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace